#include <reg52.h>//引入52系列单片机头文件
#include <intrins.h>//引入intrins内置函数

//延迟函数,单位约10微秒，此处利用的是CPU处理的延时，并不准确
//11.0952MHz测得执行时间为0.000009771593，约为9.771593微秒
void delay(unsigned int us)
{
	while(us--);//循环执行，递减
}



void main()
{
	while(1)
	{
		int i;
		P2 = 0xfe;//二进制11111110，对应LED P2^7到0
		for(i=0;i<7;i++)
		{
			P2 = _crol_(P2,1);//使LED 从11111110左移一位11111101
			delay(5000);//1秒为1000毫秒1000000微秒，此处为0.05秒，断点结束时间0.09813911
		}
		for(i=0;i<7;i++)
		{
			P2 = _cror_(P2,1);//使LED从上方代码执行后的01111111右移一位变为10111111
			delay(5000);
		}
	}
}